a5021/STM32F401CCU6-Blink-Bare-Metal/inc/main.h
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

#include <stdio.h>
#include "stm32f4xx.h"

#define ALL_ANALOG          UINT32_MAX
#define PIN_CONF(PIN, MODE) ((uint32_t) MODE << (PIN * 2))
#define PIN_AF(PIN, AF)     ((uint64_t) AF << (4 * (PIN)))

#define PIN(PIN_NO)         (PIN_NO)
#define AF(PIN_NO)          (PIN_NO)

#define PIN_MODE_INPUT      ((uint32_t) 0)
#define PIN_MODE_OUTPUT     ((uint32_t) 1)
#define PIN_MODE_ALT_FUNC   ((uint32_t) 2)
#define PIN_MODE_ANALOG     ((uint32_t) 3)

#define PINV_INPUT          ((uint32_t) 3)
#define PINV_OUTPUT         ((uint32_t) 2)
#define PINV_ALT_FUNC       ((uint32_t) 1)
#define PINV_ANALOG         ((uint32_t) 0)

#define PIN_SPEED_LOW       ((uint32_t) 0)
#define PIN_SPEED_MEDIUM    ((uint32_t) 1)
#define PIN_SPEED_HIGH      ((uint32_t) 3)

#define PIN_PULL_NO         ((uint32_t) 0)
#define PIN_PULL_UP         ((uint32_t) 1)
#define PIN_PULL_DOWN       ((uint32_t) 2)

#define LOW                 GPIO_BSRR_BR_
#define HIGH                GPIO_BSRR_BS_

#define CONCATENATE(A, B)   A ## B
#define TOGGLE_PIN(PORT, PIN, STATE)  GPIO ## PORT->BSRR = CONCATENATE(STATE, PIN)

#define DELAY_MS(MS)        for(int i = 0; i < MS; i += SysTick->CTRL >> SysTick_CTRL_COUNTFLAG_Pos) { /* */ }

#define MHZ                 *1000000UL

#define UART_BAUDRATE(FCLK, P_SPEED)    (((FCLK) + ((P_SPEED)/2U)) / (P_SPEED))

#define READ_UART(_UART_NO, BUF, LEN)   for (int i = 0; i < (LEN); i++) {                                          \
                                          while((USART##_UART_NO->SR & USART_SR_RXNE) != USART_SR_RXNE) { /****/ } \
                                          (BUF)[i] = USART##_UART_NO->DR;                                          \
                                        }

#define WRITE_UART(_UART_NO, SRC, LEN)  for (int i = 0; i < LEN; i++) {                                            \
                                          while((USART##_UART_NO->SR & USART_SR_TXE) != USART_SR_TXE) { /****/ }   \
                                          USART##_UART_NO->DR = SRC[i];                                            \
                                        }

__STATIC_INLINE void u_putc(const char c) {
  while ((USART6->SR & USART_SR_TXE) == 0);
  USART6->DR = c;
}

__STATIC_INLINE void u_puts(const char *s) {
  while (*s != 0) {
    u_putc(*s++);
  }
}

  /* Convert a nibble to HEX and send it via UART */
__STATIC_INLINE void u_put_x(const uint8_t c) {
  /* Convert a nibble to HEX char and send it via UART */
  u_putc(((c < 10) ? c + '0' : c + '7'));
}

  /* Convert a byte to HEX and send it via UART */
__STATIC_INLINE void u_putx(const uint8_t c) {
  u_put_x(c >> 4);
  u_put_x(c & 0x0F);
}

  /* MACRO to emulate printf() via UART */
#define uprintf(...) for(char _b[160]; snprintf(_b, sizeof(_b), __VA_ARGS__), u_puts(_b), 0;){}

__STATIC_INLINE void init_sys(void) {

  RCC->AHB1ENR = (
    1 * RCC_AHB1ENR_GPIOAEN          | /*  0x00000001                                            */
    0 * RCC_AHB1ENR_GPIOBEN          | /*  0x00000002                                            */
    1 * RCC_AHB1ENR_GPIOCEN          | /*  0x00000004                                            */
    0 * RCC_AHB1ENR_GPIODEN          | /*  0x00000008                                            */
    0 * RCC_AHB1ENR_GPIOEEN          | /*  0x00000010                                            */
    0 * RCC_AHB1ENR_GPIOHEN          | /*  0x00000080                                            */
    0 * RCC_AHB1ENR_CRCEN            | /*  0x00001000                                            */
    0 * RCC_AHB1ENR_DMA1EN           | /*  0x00200000                                            */
    0 * RCC_AHB1ENR_DMA2EN             /*  0x00400000                                            */
  );

  RCC->AHB2ENR = (
    0 * RCC_AHB2ENR_OTGFSEN           /*  0x00000080                                             */
  );

  RCC->APB1ENR = (
    0 * RCC_APB1ENR_TIM2EN           | /*  0x00000001                                            */
    0 * RCC_APB1ENR_TIM3EN           | /*  0x00000002                                            */
    0 * RCC_APB1ENR_TIM4EN           | /*  0x00000004                                            */
    0 * RCC_APB1ENR_TIM5EN           | /*  0x00000008                                            */
    0 * RCC_APB1ENR_WWDGEN           | /*  0x00000800                                            */
    0 * RCC_APB1ENR_SPI2EN           | /*  0x00004000                                            */
    0 * RCC_APB1ENR_SPI3EN           | /*  0x00008000                                            */
    0 * RCC_APB1ENR_USART2EN         | /*  0x00020000                                            */
    0 * RCC_APB1ENR_I2C1EN           | /*  0x00200000                                            */
    0 * RCC_APB1ENR_I2C2EN           | /*  0x00400000                                            */
    0 * RCC_APB1ENR_I2C3EN           | /*  0x00800000                                            */
    1 * RCC_APB1ENR_PWREN              /*  0x10000000                                            */
  );

  RCC->APB2ENR = (
    0 * RCC_APB2ENR_TIM1EN           | /*  0x00000001                                            */
    0 * RCC_APB2ENR_USART1EN         | /*  0x00000010                                            */
    1 * RCC_APB2ENR_USART6EN         | /*  0x00000020                                            */
    0 * RCC_APB2ENR_ADC1EN           | /*  0x00000100                                            */
    0 * RCC_APB2ENR_SDIOEN           | /*  0x00000800                                            */
    0 * RCC_APB2ENR_SPI1EN           | /*  0x00001000                                            */
    0 * RCC_APB2ENR_SPI4EN           | /*  0x00002000                                            */
    0 * RCC_APB2ENR_SYSCFGEN         | /*  0x00004000                                            */
    0 * RCC_APB2ENR_TIM9EN           | /*  0x00010000                                            */
    0 * RCC_APB2ENR_TIM10EN          | /*  0x00020000                                            */
    0 * RCC_APB2ENR_TIM11EN            /*  0x00040000                                            */
  );

  RCC->CR = RCC_CR_HSEON;
  while(! (RCC->CR & RCC_CR_HSERDY)) { ; }

  PWR->CR |= PWR_CR_DBP;               /* Enable Backup Domain Access                            */
  RCC->BDCR |= RCC_BDCR_LSEON;
  while(!(RCC->BDCR & RCC_BDCR_LSERDY)) { ; }

  RCC->BDCR |= RCC_BDCR_RTCSEL_0;      /* LSE oscillator clock used as RTC clock                 */
  RCC->BDCR |= RCC_BDCR_RTCEN;         /* Enable RTC                                             */

  PWR->CR &= ~PWR_CR_DBP;              /* Disable Backup Domain Access                           */
  RCC->APB1ENR = 0;                    /* Disable PWR interface                                  */

  /*  HSE / M * N / P                                                                            */

  /*  25Mhz / 15 * 120 / 2 = 100Mhz                                                               */

  RCC->PLLCFGR = (

    /* PLLM: Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock           */
    /*      Caution:The software has to set these bits correctly to ensure that the VCO          */
    /*      input frequency ranges from 1 to 2 MHz. It is recommended to select                  */
    /*      a frequency of 2 MHz to limit PLL jitter.                                            */

