a5021/STM32F401CCU6-Blink-Bare-Metal/inc/main.h
    0 * RCC_PLLCFGR_PLLM             | /*  0x0000003F                                            */
    1 * RCC_PLLCFGR_PLLM_0           | /*    0x00000001                                          */
    1 * RCC_PLLCFGR_PLLM_1           | /*    0x00000002                                          */
    1 * RCC_PLLCFGR_PLLM_2           | /*    0x00000004                                          */
    1 * RCC_PLLCFGR_PLLM_3           | /*    0x00000008                                          */
    0 * RCC_PLLCFGR_PLLM_4           | /*    0x00000010                                          */
    0 * RCC_PLLCFGR_PLLM_5           | /*    0x00000020                                          */

    /* PLLN: Main PLL (PLL) multiplication factor for VCO                                        */
    /*      Caution:The software has to set these bits correctly to ensure that                  */
    /*      the VCO output frequency is between 192 and 432 MHz.                                 */

    0 * RCC_PLLCFGR_PLLN             | /*  0x00007FC0                                            */
    0 * RCC_PLLCFGR_PLLN_0           | /*    0x00000040                                          */
    0 * RCC_PLLCFGR_PLLN_1           | /*    0x00000080                                          */
    0 * RCC_PLLCFGR_PLLN_2           | /*    0x00000100                                          */
    1 * RCC_PLLCFGR_PLLN_3           | /*    0x00000200                                          */
    1 * RCC_PLLCFGR_PLLN_4           | /*    0x00000400                                          */
    1 * RCC_PLLCFGR_PLLN_5           | /*    0x00000800                                          */
    1 * RCC_PLLCFGR_PLLN_6           | /*    0x00001000                                          */
    0 * RCC_PLLCFGR_PLLN_7           | /*    0x00002000                                          */
    0 * RCC_PLLCFGR_PLLN_8           | /*    0x00004000                                          */

    /* PLLP: Main PLL (PLL) division factor for main system clock                                */
    /*      PLL output clock frequency = VCO frequency / PLLP with PLLP = 2, 4, 6, or 8          */
    /*      00: PLLP = 2                                                                         */
    /*      01: PLLP = 4                                                                         */
    /*      10: PLLP = 6                                                                         */
    /*      11: PLLP = 8                                                                         */

    0 * RCC_PLLCFGR_PLLP             | /*  0x00030000                                            */
    0 * RCC_PLLCFGR_PLLP_0           | /*    0x00010000                                          */
    0 * RCC_PLLCFGR_PLLP_1           | /*    0x00020000                                          */

    /* PLLSRC: Main PLL(PLL) and audio PLL (PLLI2S) entry clock source                           */
    /*      Set and cleared by software to select PLL and PLLI2S clock source.                   */
    /*      This bit can be written only when PLL and PLLI2S are disabled.                       */
    /*      0: HSI clock selected as PLL and PLLI2S clock entry                                  */
    /*      1: HSE oscillator clock selected as PLL and PLLI2S clock entry                       */

    1 * RCC_PLLCFGR_PLLSRC_HSE       | /*  0x00400000                                            */
    0 * RCC_PLLCFGR_PLLSRC_HSI       | /*                                                        */

    /* PLLQ: Main PLL (PLL) division factor for USB OTG FS, SDIO and RNG clocks                  */

    0 * RCC_PLLCFGR_PLLQ             | /*  0x0F000000                                            */
    0 * RCC_PLLCFGR_PLLQ_0           | /*    0x01000000                                          */
    0 * RCC_PLLCFGR_PLLQ_1           | /*    0x02000000                                          */
    0 * RCC_PLLCFGR_PLLQ_2           | /*    0x04000000                                          */
    0 * RCC_PLLCFGR_PLLQ_3             /*    0x08000000                                          */
  );

  RCC->CR |= RCC_CR_PLLON;             /*  Switch PLL ON                                         */
  while((RCC->CR & RCC_CR_PLLRDY) != RCC_CR_PLLRDY) { /* Wait till PLL is ready */ }

  FLASH->ACR = (
    0 * FLASH_ACR_LATENCY_0WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_1WS        | /*                                                        */
    1 * FLASH_ACR_LATENCY_2WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_3WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_4WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_5WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_6WS        | /*                                                        */
    0 * FLASH_ACR_LATENCY_7WS        | /*                                                        */
    1 * FLASH_ACR_PRFTEN             | /*  0x00000100                                            */
    1 * FLASH_ACR_ICEN               | /*  0x00000200                                            */
    1 * FLASH_ACR_DCEN               | /*  0x00000400                                            */
    0 * FLASH_ACR_ICRST              | /*  0x00000800                                            */
    0 * FLASH_ACR_DCRST              | /*  0x00001000                                            */
    0 * FLASH_ACR_BYTE0_ADDRESS      | /*  0x40023C00                                            */
    0 * FLASH_ACR_BYTE2_ADDRESS        /*  0x40023C03                                            */
  );

  RCC->CFGR = (
    0 * RCC_CFGR_SW                  | /*  0x00000003 SW[1:0] bits (System clock Switch)         */
    0 * RCC_CFGR_SW_0                | /*    0x00000001                                          */
    0 * RCC_CFGR_SW_1                | /*    0x00000002                                          */
    0 * RCC_CFGR_SW_HSI              | /*    HSI selected as system clock                        */
    0 * RCC_CFGR_SW_HSE              | /*    HSE selected as system clock                        */
    1 * RCC_CFGR_SW_PLL              | /*    PLL selected as system clock                        */

    0 * RCC_CFGR_SWS                 | /*  0x0000000C SWS[1:0] bits (System Clock Switch Status) */
    0 * RCC_CFGR_SWS_0               | /*    0x00000004                                          */
    0 * RCC_CFGR_SWS_1               | /*    0x00000008                                          */
    0 * RCC_CFGR_SWS_HSI             | /*    HSI oscillator used as system clock                 */
    0 * RCC_CFGR_SWS_HSE             | /*    HSE oscillator used as system clock                 */
    0 * RCC_CFGR_SWS_PLL             | /*    PLL used as system clock                            */

