a5021/STM32F401CCU6-Blink-Bare-Metal/inc/main.h
    /* HPRE: AHB prescaler                                                                       */
    /*      Set and cleared by software to control AHB clock division factor.                    */
    /*      Caution: The clocks are divided with the new prescaler factor                        */
    /*      from 1 to 16 AHB cycles after HPRE write.                                            */
    /*                                                                                           */
    /*        0xxx: system clock not divided                                                     */
    /*        1000: system clock divided by 2                                                    */
    /*        1001: system clock divided by 4                                                    */
    /*        1010: system clock divided by 8                                                    */
    /*        1011: system clock divided by 16                                                   */
    /*        1100: system clock divided by 64                                                   */
    /*        1101: system clock divided by 128                                                  */
    /*        1110: system clock divided by 256                                                  */
    /*        1111: system clock divided by 512                                                  */

    0 * RCC_CFGR_HPRE                | /*  0x000000F0 HPRE[3:0] bits (AHB prescaler)             */
    0 * RCC_CFGR_HPRE_0              | /*    0x00000010                                          */
    0 * RCC_CFGR_HPRE_1              | /*    0x00000020                                          */
    0 * RCC_CFGR_HPRE_2              | /*    0x00000040                                          */
    0 * RCC_CFGR_HPRE_3              | /*    0x00000080                                          */
    1 * RCC_CFGR_HPRE_DIV1           | /*    SYSCLK not divided                                  */
    0 * RCC_CFGR_HPRE_DIV2           | /*    SYSCLK divided by 2                                 */
    0 * RCC_CFGR_HPRE_DIV4           | /*    SYSCLK divided by 4                                 */
    0 * RCC_CFGR_HPRE_DIV8           | /*    SYSCLK divided by 8                                 */
    0 * RCC_CFGR_HPRE_DIV16          | /*    SYSCLK divided by 16                                */
    0 * RCC_CFGR_HPRE_DIV64          | /*    SYSCLK divided by 64                                */
    0 * RCC_CFGR_HPRE_DIV128         | /*    SYSCLK divided by 128                               */
    0 * RCC_CFGR_HPRE_DIV256         | /*    SYSCLK divided by 256                               */
    0 * RCC_CFGR_HPRE_DIV512         | /*    SYSCLK divided by 512                               */

    0 * RCC_CFGR_PPRE1               | /*  0x00001C00 PRE1[2:0] bits (APB1 prescaler)            */
    0 * RCC_CFGR_PPRE1_0             | /*    0x00000400                                          */
    0 * RCC_CFGR_PPRE1_1             | /*    0x00000800                                          */
    0 * RCC_CFGR_PPRE1_2             | /*    0x00001000                                          */
    0 * RCC_CFGR_PPRE1_DIV1          | /*    HCLK not divided                                    */
    1 * RCC_CFGR_PPRE1_DIV2          | /*    HCLK divided by 2                                   */
    0 * RCC_CFGR_PPRE1_DIV4          | /*    HCLK divided by 4                                   */
    0 * RCC_CFGR_PPRE1_DIV8          | /*    HCLK divided by 8                                   */
    0 * RCC_CFGR_PPRE1_DIV16         | /*    HCLK divided by 16                                  */

    0 * RCC_CFGR_PPRE2               | /*  0x0000E000 PRE2[2:0] bits (APB2 prescaler)            */
    0 * RCC_CFGR_PPRE2_0             | /*    0x00002000                                          */
    0 * RCC_CFGR_PPRE2_1             | /*    0x00004000                                          */
    0 * RCC_CFGR_PPRE2_2             | /*    0x00008000                                          */
    1 * RCC_CFGR_PPRE2_DIV1          | /*    HCLK not divided                                    */
    0 * RCC_CFGR_PPRE2_DIV2          | /*    HCLK divided by 2                                   */
    0 * RCC_CFGR_PPRE2_DIV4          | /*    HCLK divided by 4                                   */
    0 * RCC_CFGR_PPRE2_DIV8          | /*    HCLK divided by 8                                   */
    0 * RCC_CFGR_PPRE2_DIV16         | /*    HCLK divided by 16                                  */

    0 * RCC_CFGR_RTCPRE              | /*  0x001F0000                                            */
    0 * RCC_CFGR_RTCPRE_0            | /*    0x00010000                                          */
    0 * RCC_CFGR_RTCPRE_1            | /*    0x00020000                                          */
    0 * RCC_CFGR_RTCPRE_2            | /*    0x00040000                                          */
    0 * RCC_CFGR_RTCPRE_3            | /*    0x00080000                                          */
    0 * RCC_CFGR_RTCPRE_4            | /*    0x00100000                                          */

    0 * RCC_CFGR_MCO1                | /*  0x00600000                                            */
    0 * RCC_CFGR_MCO1_0              | /*    0x00200000                                          */
    0 * RCC_CFGR_MCO1_1              | /*    0x00400000                                          */

    0 * RCC_CFGR_I2SSRC              | /*  0x00800000                                            */

    0 * RCC_CFGR_MCO1PRE             | /*  0x07000000                                            */
    0 * RCC_CFGR_MCO1PRE_0           | /*    0x01000000                                          */
    0 * RCC_CFGR_MCO1PRE_1           | /*    0x02000000                                          */
    0 * RCC_CFGR_MCO1PRE_2           | /*    0x04000000                                          */

    0 * RCC_CFGR_MCO2PRE             | /*  0x38000000                                            */
    0 * RCC_CFGR_MCO2PRE_0           | /*    0x08000000                                          */
    0 * RCC_CFGR_MCO2PRE_1           | /*    0x10000000                                          */
    0 * RCC_CFGR_MCO2PRE_2           | /*    0x20000000                                          */

    0 * RCC_CFGR_MCO2                | /*  0xC0000000                                            */
    0 * RCC_CFGR_MCO2_0              | /*    0x40000000                                          */
    0 * RCC_CFGR_MCO2_1                /*    0x80000000                                          */
  );

   /* Wait till System clock is ready */
  while((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL) { ; }

                 /*** Configure SysTick timer     ***/

