a5021/STM32F401CCU6-Blink-Bare-Metal/inc/main.h
  SysTick->LOAD = (uint32_t)(100000UL - 1UL);                             /* set reload register */
  SysTick->VAL  = 999UL;                                                  /* load counter value  */
  SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk;   /* start SysTick timer */

}

__STATIC_INLINE void init_gpio(void) {

  *(uint64_t *)&GPIOA->AFR = (
    PIN_AF(PIN(14),  AF(0))          | /* PA14:  AF0 SYS_SWDCLK                                  */
    PIN_AF(PIN(13),  AF(0))          | /* PA13:  AF0 SYS_SWDIO                                   */
    PIN_AF(PIN(11),  AF(8))            /* PA11:  AF8 USART6_TX                                   */
  );

  GPIOA->MODER = ALL_ANALOG - (        /*** Configure GPIOA                                      */
#ifndef SWD_DISABLED
    PIN_CONF(PIN(14), PINV_ALT_FUNC) | /* PA14 AF0 -- SYS_SWDCLK                                 */
    PIN_CONF(PIN(13), PINV_ALT_FUNC) | /* PA13 AF0 -- SYS_SWDIO                                  */
#endif
    PIN_CONF(PIN(11), PINV_ALT_FUNC)   /* PA11 AF8 -- USART6_TX                                  */
  );

  TOGGLE_PIN(C, 13, HIGH);             /* SET GPIOC PIN 13 HIGH                                  */

  GPIOC->MODER = ALL_ANALOG - (        /* Configure GPIOC                                        */
    PIN_CONF(PIN(13), PINV_OUTPUT)     /* PA13 OUTPUT PUSH-PULL                                  */
  );
}

__STATIC_INLINE void init_usart(void) {
  USART6->BRR = UART_BAUDRATE(100 MHZ, 115200);
  USART6->CR1 = (
    0 * USART_CR1_SBK        | /* 0x00000001 Send Break                             */
    0 * USART_CR1_RWU        | /* 0x00000002 Receiver wakeup                        */
    0 * USART_CR1_RE         | /* 0x00000004 Receiver Enable                        */
    1 * USART_CR1_TE         | /* 0x00000008 Transmitter Enable                     */
    0 * USART_CR1_IDLEIE     | /* 0x00000010 IDLE Interrupt Enable                  */
    0 * USART_CR1_RXNEIE     | /* 0x00000020 RXNE Interrupt Enable                  */
    0 * USART_CR1_TCIE       | /* 0x00000040 Transmission Complete Interrupt Enable */
    0 * USART_CR1_TXEIE      | /* 0x00000080 TXE Interrupt Enable                   */
    0 * USART_CR1_PEIE       | /* 0x00000100 PE Interrupt Enable                    */
    0 * USART_CR1_PS         | /* 0x00000200 Parity Selection                       */
    0 * USART_CR1_PCE        | /* 0x00000400 Parity Control Enable                  */
    0 * USART_CR1_WAKE       | /* 0x00000800 Wakeup method                          */
    0 * USART_CR1_M          | /* 0x00001000 Word length                            */
    1 * USART_CR1_UE         | /* 0x00002000 USART Enable                           */
    0 * USART_CR1_OVER8        /* 0x00008000 USART Oversampling by 8 enable         */
  );
}

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
